Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ble/advanced_applications/ble_ancs_app/firmware/src/packs/WBZ451_DFP/instance/dmac.h
/*
 * Instance header file for WBZ451
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-31T11:03:01Z */
#ifndef _BZ45_DMAC_INSTANCE_
#define _BZ45_DMAC_INSTANCE_


/* ========== Instance Parameter definitions for DMAC peripheral ========== */
#define DMAC_BURST                               (1)        
#define DMAC_CHANNEL0_INT_SRC                    (6)        /* DMA Channel 0 Interrupt */
#define DMAC_CHANNEL10_INT_SRC                   (7)        /* DMA Channel 10 Interrupt */
#define DMAC_CHANNEL11_INT_SRC                   (7)        /* DMA Channel 11 Interrupt */
#define DMAC_CHANNEL12_INT_SRC                   (7)        /* DMA Channel 12 Interrupt */
#define DMAC_CHANNEL13_INT_SRC                   (7)        /* DMA Channel 13 Interrupt */
#define DMAC_CHANNEL14_INT_SRC                   (7)        /* DMA Channel 14 Interrupt */
#define DMAC_CHANNEL15_INT_SRC                   (7)        /* DMA Channel 15 Interrupt */
#define DMAC_CHANNEL1_INT_SRC                    (6)        /* DMA Channel 1 Interrupt */
#define DMAC_CHANNEL2_INT_SRC                    (6)        /* DMA Channel 2 Interrupt */
#define DMAC_CHANNEL3_INT_SRC                    (6)        /* DMA Channel 3 Interrupt */
#define DMAC_CHANNEL4_INT_SRC                    (7)        /* DMA Channel 4 Interrupt */
#define DMAC_CHANNEL5_INT_SRC                    (7)        /* DMA Channel 5 Interrupt */
#define DMAC_CHANNEL6_INT_SRC                    (7)        /* DMA Channel 6 Interrupt */
#define DMAC_CHANNEL7_INT_SRC                    (7)        /* DMA Channel 7 Interrupt */
#define DMAC_CHANNEL8_INT_SRC                    (7)        /* DMA Channel 8 Interrupt */
#define DMAC_CHANNEL9_INT_SRC                    (7)        /* DMA Channel 9 Interrupt */
#define DMAC_CH_BITS                             (5)        
#define DMAC_CH_NUM                              (16)       
#define DMAC_EVIN_NUM                            (8)        
#define DMAC_EVOUT_NUM                           (4)        
#define DMAC_FIFO_SIZE                           (16)       
#define DMAC_INSTANCE_ID                         (34)       
#define DMAC_LVL_BITS                            (2)        
#define DMAC_LVL_NUM                             (4)        
#define DMAC_QOSCTRL_D_RESETVALUE                (2)        
#define DMAC_QOSCTRL_F_RESETVALUE                (2)        
#define DMAC_QOSCTRL_WRB_RESETVALUE              (2)        
#define DMAC_TRIG_BITS                           (7)        
#define DMAC_TRIG_NUM                            (85)       

#endif /* _BZ45_DMAC_INSTANCE_ */
